# Kroenke & Auer Chapter 2
Use this notebook to follow along with the class slides (and textbook).

## The Source Code
In this folder are the source files for the examples in textbook:
- DBP-e14-MySQL-Cape-Codd-Create-Tables.sql uses SQL Data Definition Language to create and structure the tables needed for our data
- DBP-e14-MySQL-Cape-Codd-Insert-Data.sql uses SQL Data Manipulation Language to insert data into the tables. 

Before just moving on, open each file to see what the code looks like. You will see lots of comments at the top explaining the purpose and provenance of each file. Then there are lots and lots of SQL statements. They may look like jibberish for now, but within a couple weeks you will know enough to be able to write these files for yourself! 

## The Live Database
To keep things simple, these source files have already been preloaded into a MySQL database on BA Lab server. The commands the system admin used were:
```
mysqladmin create cape_codd
mysql cape_code <DBP-e14-MySQL-Cape-Codd-Create-Tables.sql
mysql cape_codd <DBP-e14-MySQL-Cape-Codd-Insert-Data.sql
```
The above statements are in bash, a langauge for unix system administration from the command line. Can you figure out what each line does? 

After loading the database, user permissions were then granted separately with the SQL command:
```
GRANT SELECT on cape_codd.* to 'ba510student'@'localhost' IDENTIFIED BY 'ba510';
```

The rest of this Notebook will use SQL to extract data from the database.

## Connect to the Database
Fill in the <connect-string> (below) with a properly crafted connect string with the following parameters:
- method: mysql+pymysql
- user: ba510student
- password: ba510
- host: localhost
- database name: cape_codd

In [14]:
%load_ext sql
%sql mysql+pymysql://ba510student:ba510@localhost/cape_codd

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: ba510student@cape_codd'

In [21]:
%%sql
SELECT * FROM information_schema.tables WHERE TABLE_TYPE = 'BASE TABLE';

 * mysql+pymysql://ba510student:***@localhost/cape_codd
8 rows affected.

[('def', 'cape_codd', 'CATALOG_SKU_2013', 'BASE TABLE', 'InnoDB', 10, 'Dynamic', 0, 0, 16384, 0, 0, 0, 1, datetime.datetime(2019, 2, 2, 0, 1, 31), None, None, 'latin1_swedish_ci', None, '', ''),
 ('def', 'cape_codd', 'CATALOG_SKU_2014', 'BASE TABLE', 'InnoDB', 10, 'Dynamic', 0, 0, 16384, 0, 0, 0, 1, datetime.datetime(2019, 2, 2, 0, 1, 31), None, None, 'latin1_swedish_ci', None, '', ''),
 ('def', 'cape_codd', 'CATALOG_SKU_2015', 'BASE TABLE', 'InnoDB', 10, 'Dynamic', 0, 0, 16384, 0, 0, 0, 1, datetime.datetime(2019, 2, 2, 0, 1, 31), None, None, 'latin1_swedish_ci', None, '', ''),
 ('def', 'cape_codd', 'INVENTORY', 'BASE TABLE', 'InnoDB', 10, 'Dynamic', 32, 512, 16384, 0, 16384, 0, None, datetime.datetime(2019, 2, 2, 0, 1, 31), None, None, 'latin1_swedish_ci', None, '', ''),
 ('def', 'cape_codd', 'ORDER_ITEM', 'BASE TABLE', 'InnoDB', 10, 'Dynamic', 7, 2340, 16384, 0, 16384, 0, None, datetime.datetime(2019, 2, 2, 0, 1, 31), None, None, 'latin1_swedish_ci', None, '', ''),
 ('def', 'cape_codd', 'RETAIL_ORDER', 'BASE TABLE', 'InnoDB', 10, 'Dynamic', 2, 8192, 16384, 0, 0, 0, None, datetime.datetime(2019, 2, 2, 0, 1, 31), None, None, 'latin1_swedish_ci', None, '', ''),
 ('def', 'cape_codd', 'SKU_DATA', 'BASE TABLE', 'InnoDB', 10, 'Dynamic', 8, 2048, 16384, 0, 0, 0, None, datetime.datetime(2019, 2, 2, 0, 1, 31), None, None, 'latin1_swedish_ci', None, '', ''),
 ('def', 'cape_codd', 'WAREHOUSE', 'BASE TABLE', 'InnoDB', 10, 'Dynamic', 4, 4096, 16384, 0, 0, 0, None, datetime.datetime(2019, 2, 2, 0, 1, 31), None, None, 'latin1_swedish_ci', None, '', '')]

## Try out the queries in the class slides
Each query should be run in a single cell with `%%sql` magic at the top. You will need to add cells as you go along. Tip: use Markdown cells to annotate your queries so you know what they are about. Alternatively, you could use /* */ comments instead. It's up to you.

In [42]:
%%sql
/* *** First SQL Query *** */
SELECT SKU, SKU_Description, Department, Buyer FROM SKU_DATA ORDER BY SKU_DESCRIPTION, SKU DESC;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
8 rows affected.

[(101200, 'Dive Mask, Med Clear', 'Water Sports', 'Nancy Meyers'),
 (101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers'),
 (201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),
 (202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo'),
 (301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin'),
 (100200, 'Std. Scuba Tank, Magenta', 'Water Sports', 'Pete Hansen'),
 (100100, 'Std. Scuba Tank, Yellow', 'Water Sports', 'Pete Hansen')]

In [39]:
%%sql
SELECT * FROM INVENTORY WHERE QuantityOnHand < 10;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
9 rows affected.

[(100, 101100, 'Dive Mask, Small Clear', 0, 500),
 (200, 101100, 'Dive Mask, Small Clear', 0, 500),
 (100, 201000, 'Half-dome Tent', 2, 100),
 (400, 201000, 'Half-dome Tent', 0, 250),
 (200, 202000, 'Half-dome Tent Vestibule', 1, 250),
 (400, 202000, 'Half-dome Tent Vestibule', 0, 200),
 (300, 301000, 'Light Fly Climbing Harness', 0, 250),
 (400, 301000, 'Light Fly Climbing Harness', 0, 250),
 (400, 302000, 'Locking Carabiner, Oval', 0, 1000)]

In [40]:
%%sql
SELECT DISTINCT Buyer FROM SKU_DATA;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
4 rows affected.

[('Pete Hansen',), ('Nancy Meyers',), ('Cindy Lo',), ('Jerry Martin',)]

In [44]:
%%sql

/* *** CANNOT CREATE VIEWS AS USER *** */

CREATE VIEW SKU_TENTS AS (SELECT SKU, SKU_Description FROM INVENTORY WHERE SKU_Description LIKE '%Tent%')

 * mysql+pymysql://ba510student:***@localhost/cape_codd
(pymysql.err.OperationalError) (1142, "CREATE VIEW command denied to user 'ba510student'@'localhost' for table 'SKU_TENTS'") [SQL: "/* *** CANNOT CREATE VIEWS AS USER *** */\n\nCREATE VIEW SKU_TENTS AS (SELECT SKU, SKU_Description FROM INVENTORY WHERE SKU_Description LIKE '%%Tent%%')"] (Background on this error at: http://sqlalche.me/e/e3q8)

In [45]:
%%sql

SELECT * FROM CATALOG_SKU_2014 WHERE DateOnWebsite = '01-Jan-2014';

 * mysql+pymysql://ba510student:***@localhost/cape_codd
0 rows affected.

/opt/tljh/user/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1292, "Incorrect date value: '01-Jan-2014' for column 'DateOnWebsite' at row 1")
  result = self._query(query)

[]

In [47]:
%%sql

SELECT * FROM SKU_DATA WHERE Buyer IN ('Nancy Meyeres', 'Cindy Lo', 'Jerry Martin');

 * mysql+pymysql://ba510student:***@localhost/cape_codd
4 rows affected.

[(201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),
 (202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo'),
 (301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin')]

In [49]:
%%sql

SELECT * FROM ORDER_ITEM WHERE ExtendedPrice BETWEEN 100 AND 200;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
4 rows affected.

[(2000, 101100, 4, Decimal('50.00'), Decimal('200.00')),
 (3000, 101100, 2, Decimal('50.00'), Decimal('100.00')),
 (2000, 101200, 2, Decimal('50.00'), Decimal('100.00')),
 (1000, 202000, 1, Decimal('130.00'), Decimal('130.00'))]

In [53]:
%%sql

SELECT * FROM SKU_DATA WHERE Buyer LIKE 'N%';

 * mysql+pymysql://ba510student:***@localhost/cape_codd
2 rows affected.

[(101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers'),
 (101200, 'Dive Mask, Med Clear', 'Water Sports', 'Nancy Meyers')]

In [55]:
%%sql

SELECT * FROM CATALOG_SKU_2015 WHERE CatalogPage IS NULL;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
0 rows affected.

[]

In [57]:
%%sql

SELECT * FROM SKU_DATA WHERE (SKU>200000 OR SKU_Description LIKE '%TENT%' AND NOT Department = 'Camping');

 * mysql+pymysql://ba510student:***@localhost/cape_codd
4 rows affected.

[(201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),
 (202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo'),
 (301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin')]

In [59]:
%%sql

SELECT COUNT(SKU) FROM SKU_DATA;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
1 rows affected.

[(8,)]

In [61]:
%%sql

SELECT MAX(SKU) FROM SKU_DATA;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
1 rows affected.

[(302000,)]

In [63]:
%%sql

SELECT (Quantity * Price) AS EP FROM ORDER_ITEM;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
7 rows affected.

[(Decimal('300.00'),),
 (Decimal('200.00'),),
 (Decimal('100.00'),),
 (Decimal('100.00'),),
 (Decimal('50.00'),),
 (Decimal('300.00'),),
 (Decimal('130.00'),)]

In [65]:
%%sql

SELECT * FROM ORDER_ITEM WHERE (Quantity * Price) > 150;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
3 rows affected.

[(3000, 100200, 1, Decimal('300.00'), Decimal('300.00')),
 (2000, 101100, 4, Decimal('50.00'), Decimal('200.00')),
 (1000, 201000, 1, Decimal('300.00'), Decimal('300.00'))]

In [74]:
%%sql

/* *** GROUPING *** */
SELECT SKU, COUNT(SKU), AVG(ExtendedPrice) FROM ORDER_ITEM GROUP BY SKU;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
5 rows affected.

[(100200, 1, Decimal('300.000000')),
 (101100, 2, Decimal('150.000000')),
 (101200, 2, Decimal('75.000000')),
 (201000, 1, Decimal('300.000000')),
 (202000, 1, Decimal('130.000000'))]

In [76]:
%%sql

/* *** HAVING CLAUSE *** */
SELECT SKU, SUM(QuantityOnHand) AS QuantOnHand FROM INVENTORY GROUP BY SKU HAVING QuantOnHand < 1000;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
7 rows affected.

[(100100, Decimal('650')),
 (100200, Decimal('625')),
 (101100, Decimal('750')),
 (101200, Decimal('875')),
 (201000, Decimal('262')),
 (202000, Decimal('111')),
 (301000, Decimal('550'))]

In [78]:
%%sql

/* *** ORDER BY WITH GROUPS *** */
SELECT SKU, SUM(QuantityOnHand) AS QuantOnHand FROM INVENTORY GROUP BY SKU ORDER BY QuantOnHand DESC;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
8 rows affected.

[(302000, Decimal('2750')),
 (101200, Decimal('875')),
 (101100, Decimal('750')),
 (100100, Decimal('650')),
 (100200, Decimal('625')),
 (301000, Decimal('550')),
 (201000, Decimal('262')),
 (202000, Decimal('111'))]

In [82]:
%%sql

/* *** Fun *** */
SELECT * FROM sys.database_principals;

 * mysql+pymysql://ba510student:***@localhost/cape_codd
(pymysql.err.OperationalError) (1142, "SELECT command denied to user 'ba510student'@'localhost' for table 'database_principals'") [SQL: '/* *** Fun *** */\nSELECT * FROM sys.database_principals;'] (Background on this error at: http://sqlalche.me/e/e3q8)